app/views/islands/index.html.erb

SELECT `hotels`.* FROM `hotels`  WHERE `hotels`.`island_id` = ?  [["island_id", 5]]
---

        <% island.hotels.each do |hotel| %>