app/views/islands/show.html.erb

  <dd>
    <%= if @island.hotels.count == 0; 'None' end %>
---
SELECT COUNT(*) FROM `hotels`  WHERE `hotels`.`island_id` = ?  [["island_id", 5]]
SELECT `hotels`.* FROM `hotels`  WHERE `hotels`.`island_id` = ?  [["island_id", 5]]