app/controllers/hotels_controller.rb

SELECT `hotels`.* FROM `hotels`
---
    def index
        @hotels = Hotel.all

SELECT `hotels`.* FROM `hotels`
---
    def all
        @hotels = Hotel.all

SELECT  `hotels`.* FROM `hotels`  WHERE `hotels`.`id` = ? LIMIT 1  [["id", 13]]
---
    def show
        @hotel = Hotel.find(params[:id])