app/controllers/islands_controller.rb

    def index
        @islands = Island.all
---
SELECT `islands`.* FROM `islands`

    def all
        @islands = Island.all
---
SELECT `islands`.* FROM `islands`

    def show
        @island = Island.find(params[:id])
---
SELECT  `islands`.* FROM `islands`  WHERE `islands`.`id` = ? LIMIT 1  [["id", 1]]