app/controllers/promos_controller.rb

    def index
        @promos = Promo.all
---
SELECT `promos`.* FROM `promos`

    def all
        @promos = Promo.all
---
SELECT `promos`.* FROM `promos`

    def show
        @promo = Promo.find(params[:id])
---
SELECT  `promos`.* FROM `promos`  WHERE `promos`.`id` = ? LIMIT 1  [["id", 1]]