app/views/destinations/index.html.erb


            <% destination.islands.each do |island| %>
---
SELECT `islands`.* FROM `islands`  WHERE `islands`.`destination_id` = ?  [["destination_id", 3]]


            <% destination.hotels.each do |hotel| %>
---
SELECT `hotels`.* FROM `hotels`  WHERE `hotels`.`destination_id` = ?  [["destination_id", 3]]