app/views/destinations/show.html.erb

SELECT COUNT(*) FROM `islands`  WHERE `islands`.`destination_id` = ?  [["destination_id", 6]]
SELECT `islands`.* FROM `islands`  WHERE `islands`.`destination_id` = ?  [["destination_id", 6]]
---
  <dd>
    <%= if @destination.islands.count == 0; 'None' end %>

SELECT COUNT(*) FROM `hotels`  WHERE `hotels`.`destination_id` = ?  [["destination_id", 6]]
SELECT `hotels`.* FROM `hotels`  WHERE `hotels`.`destination_id` = ?  [["destination_id", 6]]
---
  <dd>
    <%= if @destination.hotels.count == 0; 'None' end %>