app/views/hotels/index.html.erb


        <% hotel.hotel_pictures.each do |hotel_picture| %>
---
SELECT `hotel_pictures`.* FROM `hotel_pictures`  WHERE `hotel_pictures`.`hotel_id` = ?  [["hotel_id", 11]]
SELECT `hotels`.* FROM `hotels`